[Killed] BlockStatement
components/About.js:4:21
 import React from 'react';
 import { View, Text, StyleSheet, Linking } from 'react-native';
 
-const About = () => {
-    return (
-        <View style={styles.container}>
-            <Text style={styles.text}> App created by zero7zero5 on GitHub </Text>
-            <Text
-                style={[styles.link]}
-                onPress={() => Linking.openURL("https://github.com/zero7zero5/React-Native-Calculator-App")}>
-                github.com/zero7zero5/React-Native-Calculator-App
-            </Text>
-        </View>
-    );
-};
+const About = () => {};
 
 const styles = StyleSheet.create({
killedBy: UI Testing Suite About screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite About screen matches snapshot 1`

Snapshot: <View
  style={
    {
      "alignItems": "center",

[Survived] ArrowFunction
components/About.js:10:26
             <Text style={styles.text}> App created by zero7zero5 on GitHub </Text>
             <Text
                 style={[styles.link]}
-                onPress={() => Linking.openURL("https://github.com/zero7zero5/React-Native-Calculator-App")}>
+                onPress={() => undefined}>
                 github.com/zero7zero5/React-Native-Calculator-App
             </Text>

[NoCoverage] StringLiteral
components/About.js:10:48
             <Text style={styles.text}> App created by zero7zero5 on GitHub </Text>
             <Text
                 style={[styles.link]}
-                onPress={() => Linking.openURL("https://github.com/zero7zero5/React-Native-Calculator-App")}>
+                onPress={() => Linking.openURL("")}>
                 github.com/zero7zero5/React-Native-Calculator-App
             </Text>

[Killed] ObjectLiteral
components/About.js:17:34
     );
 };
 
-const styles = StyleSheet.create({
-    container: {
-        flex: 1,
-        justifyContent: 'center',
-        alignItems: 'center',
-    },
-    text: {
-        fontSize: 16,
-        margin: 10,
-    },
-    link: {
-        color: 'blue',
-        textDecorationLine: 'underline',
-    },
-});
+const styles = StyleSheet.create({});
 
 export default About;
killedBy: UI Testing Suite About screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite About screen matches snapshot 1`

- Snapshot  - 21
+ Received  +  3

@@ -1,32 +1,14 @@

[Killed] ObjectLiteral
components/About.js:18:16
 };
 
 const styles = StyleSheet.create({
-    container: {
-        flex: 1,
-        justifyContent: 'center',
-        alignItems: 'center',
-    },
+    container: {},
     text: {
         fontSize: 16,
killedBy: UI Testing Suite About screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite About screen matches snapshot 1`

- Snapshot  - 7
+ Received  + 1

@@ -1,13 +1,7 @@

[Killed] StringLiteral
components/About.js:29:29
     },
     link: {
         color: 'blue',
-        textDecorationLine: 'underline',
+        textDecorationLine: "",
     },
 });
killedBy: UI Testing Suite About screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite About screen matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -21,11 +21,11 @@
