[NoCoverage] BlockStatement
components/AboutButton.js:5:27
 import React from "react"
 import { Button } from "react-native"
 
-const AboutButton = () => {
-    const navigation = useNavigation()
-
-    return (
-        <Button
-            title="About"
-            onPress={() => {
-                navigation.navigate("About");
-            }}
-        />
-    );
-}
+const AboutButton = () => {}
 
 export default AboutButton

[NoCoverage] BlockStatement
components/AboutButton.js:11:28
     return (
         <Button
             title="About"
-            onPress={() => {
-                navigation.navigate("About");
-            }}
+            onPress={() => {}}
         />
     );
