[Killed] StringLiteral
components/Button.js:6:21
 
 const Button = ({
   children,
-  backgroundColor = "#cccccc",
+  backgroundColor = "",
   width = 80,
   onPress,
killedBy: UI Testing Suite Button component matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Button component matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -42,11 +42,11 @@

[Killed] BlockStatement
components/Button.js:9:7
   backgroundColor = "#cccccc",
   width = 80,
   onPress,
-}) => {
-  return (
-    <TouchableOpacity activeOpacity={0.6} onPress={onPress}>
-      <View style={[styles.container, { backgroundColor, width }]}>
-        <Text style={styles.text}>{children}</Text>
-      </View>
-    </TouchableOpacity>
-  );
-};
+}) => {};
 
 const styles = StyleSheet.create({
killedBy: Unit Testing Suite AC Button works correctly
statusReason: Error: Unable to find an element with text: AC

<View>
  <TextInput
    testID="text-input"
    value="4873789598275"
  />
  <View>

[Killed] ObjectLiteral
components/Button.js:28:9
     justifyContent: "center",
     alignItems: "center",
   },
-  text: {
-    fontSize: 40,
-    fontWeight: "300",
-  },
+  text: {},
 });
 
killedBy: UI Testing Suite Button component matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Button component matches snapshot 1`

- Snapshot  - 6
+ Received  + 1

@@ -49,14 +49,9 @@

[Killed] StringLiteral
components/Button.js:30:17
   },
   text: {
     fontSize: 40,
-    fontWeight: "300",
+    fontWeight: "",
   },
 });
killedBy: UI Testing Suite Button component matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Button component matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -52,11 +52,11 @@
