[Timeout] BlockStatement
components/Home.js:9:26
 const Home = () => {
   const [input, setInput] = useState("");
 
-  const caculate = () => {
-    let actualString = "";
-    for (let a of input) {
-      if (a === "x") actualString = actualString + "*";
-      else actualString += a;
-    }
-    const last = actualString.charAt(actualString.length - 1);
-    console.log(last);
-    if (
-      last === "/" ||
-      last === "+" ||
-      last === "-" ||
-      last == "x" ||
-      last == "."
-    ) {
-      actualString = actualString.slice(0, actualString.length - 1);
-    }
-    console.log(actualString);
-    const result = eval(actualString) + "";
-    setInput(result);
-  };
+  const caculate = () => {};
 
   const addOperator = (op) => {

[Killed] BlockStatement
components/Home.js:11:26
 
   const caculate = () => {
     let actualString = "";
-    for (let a of input) {
-      if (a === "x") actualString = actualString + "*";
-      else actualString += a;
-    }
+    for (let a of input) {}
     const last = actualString.charAt(actualString.length - 1);
     console.log(last);
killedBy: Unit Testing Suite Div button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "61.5"
Received: "undefined"

[Killed] EqualityOperator
components/Home.js:12:11
   const caculate = () => {
     let actualString = "";
     for (let a of input) {
-      if (a === "x") actualString = actualString + "*";
+      if (a !== "x") actualString = actualString + "*";
       else actualString += a;
     }
killedBy: Unit Testing Suite Div button works correctly
statusReason: SyntaxError: Unexpected token '**'

[Killed] ConditionalExpression
components/Home.js:12:11
   const caculate = () => {
     let actualString = "";
     for (let a of input) {
-      if (a === "x") actualString = actualString + "*";
+      if (true) actualString = actualString + "*";
       else actualString += a;
     }
killedBy: Unit Testing Suite Div button works correctly
statusReason: SyntaxError: Unexpected token '**'

[Killed] AssignmentOperator
components/Home.js:13:12
     let actualString = "";
     for (let a of input) {
       if (a === "x") actualString = actualString + "*";
-      else actualString += a;
+      else actualString -= a;
     }
     const last = actualString.charAt(actualString.length - 1);
killedBy: Unit Testing Suite Div button works correctly
statusReason: TypeError: actualString.charAt is not a function

[Killed] ArithmeticOperator
components/Home.js:15:38
       if (a === "x") actualString = actualString + "*";
       else actualString += a;
     }
-    const last = actualString.charAt(actualString.length - 1);
+    const last = actualString.charAt(actualString.length + 1);
     console.log(last);
     if (
killedBy: Unit Testing Suite Equals button works with last character / 
statusReason: SyntaxError: Unexpected end of input

[Killed] MethodExpression
components/Home.js:15:18
       if (a === "x") actualString = actualString + "*";
       else actualString += a;
     }
-    const last = actualString.charAt(actualString.length - 1);
+    const last = actualString;
     console.log(last);
     if (
killedBy: Unit Testing Suite Equals button works with last character / 
statusReason: SyntaxError: Unexpected end of input

[Killed] LogicalOperator
components/Home.js:18:7
     const last = actualString.charAt(actualString.length - 1);
     console.log(last);
     if (
-      last === "/" ||
-      last === "+" ||
-      last === "-" ||
+      (last === "/" || last === "+") && last === "-" ||
       last == "x" ||
       last == "."
killedBy: Unit Testing Suite Equals button works with last character / 
statusReason: SyntaxError: Unexpected end of input

[Killed] ConditionalExpression
components/Home.js:18:7
     const last = actualString.charAt(actualString.length - 1);
     console.log(last);
     if (
-      last === "/" ||
-      last === "+" ||
-      last === "-" ||
-      last == "x" ||
-      last == "."
+      false
     ) {
       actualString = actualString.slice(0, actualString.length - 1);
killedBy: Unit Testing Suite Equals button works with last character / 
statusReason: SyntaxError: Unexpected end of input

[Killed] EqualityOperator
components/Home.js:19:7
     console.log(last);
     if (
       last === "/" ||
-      last === "+" ||
+      last !== "+" ||
       last === "-" ||
       last == "x" ||
killedBy: Unit Testing Suite Div button works correctly
statusReason: SyntaxError: Unexpected end of input

[Survived] ConditionalExpression
components/Home.js:19:7
     console.log(last);
     if (
       last === "/" ||
-      last === "+" ||
+      false ||
       last === "-" ||
       last == "x" ||

[Killed] EqualityOperator
components/Home.js:20:7
     if (
       last === "/" ||
       last === "+" ||
-      last === "-" ||
+      last !== "-" ||
       last == "x" ||
       last == "."
killedBy: Unit Testing Suite Div button works correctly
statusReason: SyntaxError: Unexpected end of input

[Survived] ConditionalExpression
components/Home.js:20:7
     if (
       last === "/" ||
       last === "+" ||
-      last === "-" ||
+      false ||
       last == "x" ||
       last == "."

[Killed] EqualityOperator
components/Home.js:21:7
       last === "/" ||
       last === "+" ||
       last === "-" ||
-      last == "x" ||
+      last != "x" ||
       last == "."
     ) {
killedBy: Unit Testing Suite Div button works correctly
statusReason: SyntaxError: Unexpected end of input

[Survived] ConditionalExpression
components/Home.js:21:7
       last === "/" ||
       last === "+" ||
       last === "-" ||
-      last == "x" ||
+      false ||
       last == "."
     ) {

[Killed] EqualityOperator
components/Home.js:22:7
       last === "+" ||
       last === "-" ||
       last == "x" ||
-      last == "."
+      last != "."
     ) {
       actualString = actualString.slice(0, actualString.length - 1);
killedBy: Unit Testing Suite Div button works correctly
statusReason: SyntaxError: Unexpected end of input

[Survived] ConditionalExpression
components/Home.js:22:7
       last === "+" ||
       last === "-" ||
       last == "x" ||
-      last == "."
+      false
     ) {
       actualString = actualString.slice(0, actualString.length - 1);

[Killed] BlockStatement
components/Home.js:23:7
       last === "-" ||
       last == "x" ||
       last == "."
-    ) {
-      actualString = actualString.slice(0, actualString.length - 1);
-    }
+    ) {}
     console.log(actualString);
     const result = eval(actualString) + "";
killedBy: Unit Testing Suite Equals button works with last character / 
statusReason: SyntaxError: Unexpected end of input

[Killed] ArithmeticOperator
components/Home.js:24:44
       last == "x" ||
       last == "."
     ) {
-      actualString = actualString.slice(0, actualString.length - 1);
+      actualString = actualString.slice(0, actualString.length + 1);
     }
     console.log(actualString);
killedBy: Unit Testing Suite Equals button works with last character / 
statusReason: SyntaxError: Unexpected end of input

[Killed] MethodExpression
components/Home.js:24:22
       last == "x" ||
       last == "."
     ) {
-      actualString = actualString.slice(0, actualString.length - 1);
+      actualString = actualString;
     }
     console.log(actualString);
killedBy: Unit Testing Suite Equals button works with last character / 
statusReason: SyntaxError: Unexpected end of input

[Killed] BlockStatement
components/Home.js:31:31
     setInput(result);
   };
 
-  const addOperator = (op) => {
-    let exp = input;
-    const last = exp.charAt(exp.length - 1);
-    if (last === "x" || last === "+" || last === "-" || last === "/") {
-      exp = exp.slice(0, -1) + op;
-      setInput(exp);
-    } else {
-      exp = exp + op;
-      setInput(exp);
-    }
-  };
+  const addOperator = (op) => {};
 
   const clear = () => {
killedBy: Unit Testing Suite Div button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "61.5"
Received: "1232"

[Killed] ArithmeticOperator
components/Home.js:33:29
 
   const addOperator = (op) => {
     let exp = input;
-    const last = exp.charAt(exp.length - 1);
+    const last = exp.charAt(exp.length + 1);
     if (last === "x" || last === "+" || last === "-" || last === "/") {
       exp = exp.slice(0, -1) + op;
killedBy: Unit Testing Suite Plus button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "123+"
Received: "123/+"

[Killed] MethodExpression
components/Home.js:33:18
 
   const addOperator = (op) => {
     let exp = input;
-    const last = exp.charAt(exp.length - 1);
+    const last = exp;
     if (last === "x" || last === "+" || last === "-" || last === "/") {
       exp = exp.slice(0, -1) + op;
killedBy: Unit Testing Suite Plus button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "123+"
Received: "123/+"

[Killed] LogicalOperator
components/Home.js:34:9
   const addOperator = (op) => {
     let exp = input;
     const last = exp.charAt(exp.length - 1);
-    if (last === "x" || last === "+" || last === "-" || last === "/") {
+    if ((last === "x" || last === "+" || last === "-") && last === "/") {
       exp = exp.slice(0, -1) + op;
       setInput(exp);
killedBy: Unit Testing Suite Plus button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "123+"
Received: "123/+"

[Killed] EqualityOperator
components/Home.js:34:9
   const addOperator = (op) => {
     let exp = input;
     const last = exp.charAt(exp.length - 1);
-    if (last === "x" || last === "+" || last === "-" || last === "/") {
+    if (last !== "x" || last === "+" || last === "-" || last === "/") {
       exp = exp.slice(0, -1) + op;
       setInput(exp);
killedBy: Unit Testing Suite Div button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "61.5"
Received: "6"

[Killed] MethodExpression
components/Home.js:35:13
     let exp = input;
     const last = exp.charAt(exp.length - 1);
     if (last === "x" || last === "+" || last === "-" || last === "/") {
-      exp = exp.slice(0, -1) + op;
+      exp = exp + op;
       setInput(exp);
     } else {
killedBy: Unit Testing Suite Plus button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "123+"
Received: "123/+"

[Killed] UnaryOperator
components/Home.js:35:26
     let exp = input;
     const last = exp.charAt(exp.length - 1);
     if (last === "x" || last === "+" || last === "-" || last === "/") {
-      exp = exp.slice(0, -1) + op;
+      exp = exp.slice(0, +1) + op;
       setInput(exp);
     } else {
killedBy: Unit Testing Suite Plus button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "123+"
Received: "1+"

[Killed] BlockStatement
components/Home.js:37:12
     if (last === "x" || last === "+" || last === "-" || last === "/") {
       exp = exp.slice(0, -1) + op;
       setInput(exp);
-    } else {
-      exp = exp + op;
-      setInput(exp);
-    }
+    } else {}
   };
 
killedBy: Unit Testing Suite Div button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "61.5"
Received: "1232"

[Killed] ArithmeticOperator
components/Home.js:38:13
       exp = exp.slice(0, -1) + op;
       setInput(exp);
     } else {
-      exp = exp + op;
+      exp = exp - op;
       setInput(exp);
     }
killedBy: Unit Testing Suite Div button works correctly
statusReason: ReferenceError: NaN2 is not defined

[Killed] BlockStatement
components/Home.js:43:23
     }
   };
 
-  const clear = () => {
-    setInput(input.slice(0, input.length - 1));
-  };
+  const clear = () => {};
 
   const percentage = () => {
killedBy: Unit Testing Suite C Button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "487378959827"
Received: "4873789598275"

[Killed] MethodExpression
components/Home.js:44:14
   };
 
   const clear = () => {
-    setInput(input.slice(0, input.length - 1));
+    setInput(input);
   };
 
killedBy: Unit Testing Suite C Button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "487378959827"
Received: "4873789598275"

[Killed] ArithmeticOperator
components/Home.js:44:29
   };
 
   const clear = () => {
-    setInput(input.slice(0, input.length - 1));
+    setInput(input.slice(0, input.length + 1));
   };
 
killedBy: Unit Testing Suite C Button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "487378959827"
Received: "4873789598275"

[Killed] BlockStatement
components/Home.js:47:28
     setInput(input.slice(0, input.length - 1));
   };
 
-  const percentage = () => {
-    let exp = input;
-    let last = input.charAt(input.length - 1);
-    if (last === "/" || last === "x" || last === "-" || last === "+") {
-      exp = exp.slice(0, exp.length - 1);
-    }
-    setInput(eval(exp + "/100") + "");
-  };
+  const percentage = () => {};
 
   return (
killedBy: Unit Testing Suite Percent button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "48737895982.75"
Received: "4873789598275"

[Killed] ArithmeticOperator
components/Home.js:49:29
 
   const percentage = () => {
     let exp = input;
-    let last = input.charAt(input.length - 1);
+    let last = input.charAt(input.length + 1);
     if (last === "/" || last === "x" || last === "-" || last === "+") {
       exp = exp.slice(0, exp.length - 1);
killedBy: Unit Testing Suite Percent button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1.23"
Received: "123"

[Killed] MethodExpression
components/Home.js:49:16
 
   const percentage = () => {
     let exp = input;
-    let last = input.charAt(input.length - 1);
+    let last = input;
     if (last === "/" || last === "x" || last === "-" || last === "+") {
       exp = exp.slice(0, exp.length - 1);
killedBy: Unit Testing Suite Percent button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1.23"
Received: "123"

[Killed] EqualityOperator
components/Home.js:50:25
   const percentage = () => {
     let exp = input;
     let last = input.charAt(input.length - 1);
-    if (last === "/" || last === "x" || last === "-" || last === "+") {
+    if (last === "/" || last !== "x" || last === "-" || last === "+") {
       exp = exp.slice(0, exp.length - 1);
     }
killedBy: Unit Testing Suite Percent button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "48737895982.75"
Received: "4873789598.27"

[Killed] BlockStatement
components/Home.js:50:71
   const percentage = () => {
     let exp = input;
     let last = input.charAt(input.length - 1);
-    if (last === "/" || last === "x" || last === "-" || last === "+") {
-      exp = exp.slice(0, exp.length - 1);
-    }
+    if (last === "/" || last === "x" || last === "-" || last === "+") {}
     setInput(eval(exp + "/100") + "");
   };
killedBy: Unit Testing Suite Percent button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1.23"
Received: "123"

[Killed] ArithmeticOperator
components/Home.js:51:26
     let exp = input;
     let last = input.charAt(input.length - 1);
     if (last === "/" || last === "x" || last === "-" || last === "+") {
-      exp = exp.slice(0, exp.length - 1);
+      exp = exp.slice(0, exp.length + 1);
     }
     setInput(eval(exp + "/100") + "");
killedBy: Unit Testing Suite Percent button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1.23"
Received: "123"

[Killed] MethodExpression
components/Home.js:51:13
     let exp = input;
     let last = input.charAt(input.length - 1);
     if (last === "/" || last === "x" || last === "-" || last === "+") {
-      exp = exp.slice(0, exp.length - 1);
+      exp = exp;
     }
     setInput(eval(exp + "/100") + "");
killedBy: Unit Testing Suite Percent button works with last character / 
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "1.23"
Received: "123"

[Killed] StringLiteral
components/Home.js:53:25
     if (last === "/" || last === "x" || last === "-" || last === "+") {
       exp = exp.slice(0, exp.length - 1);
     }
-    setInput(eval(exp + "/100") + "");
+    setInput(eval(exp + "") + "");
   };
 
killedBy: Unit Testing Suite Percent button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "48737895982.75"
Received: "4873789598275"

[Killed] ArrowFunction
components/Home.js:61:28
       <TextBox value={input} onChangeText={setInput} />
       <View style={styles.buttonContainer}>
         <View style={styles.row}>
-          <Button onPress={() => setInput("")} testID="ac-button" backgroundColor="gold">
+          <Button onPress={() => undefined} testID="ac-button" backgroundColor="gold">
             AC
           </Button>
killedBy: Unit Testing Suite AC Button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "4873789598275"

[Killed] StringLiteral
components/Home.js:61:43
       <TextBox value={input} onChangeText={setInput} />
       <View style={styles.buttonContainer}>
         <View style={styles.row}>
-          <Button onPress={() => setInput("")} testID="ac-button" backgroundColor="gold">
+          <Button onPress={() => setInput("Stryker was here!")} testID="ac-button" backgroundColor="gold">
             AC
           </Button>
killedBy: Unit Testing Suite AC Button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ""
Received: "Stryker was here!"

[Killed] ArrowFunction
components/Home.js:70:28
           <Button onPress={percentage} backgroundColor="gold">
             %
           </Button>
-          <Button onPress={() => addOperator("/")} backgroundColor="#ffa31a">
+          <Button onPress={() => undefined} backgroundColor="#ffa31a">
             /
           </Button>
killedBy: Unit Testing Suite Div button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "61.5"
Received: "1232"

[Killed] StringLiteral
components/Home.js:70:46
           <Button onPress={percentage} backgroundColor="gold">
             %
           </Button>
-          <Button onPress={() => addOperator("/")} backgroundColor="#ffa31a">
+          <Button onPress={() => addOperator("")} backgroundColor="#ffa31a">
             /
           </Button>
killedBy: Unit Testing Suite Div button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "61.5"
Received: "1232"

[Killed] ArrowFunction
components/Home.js:75:28
           </Button>
         </View>
         <View style={styles.row}>
-          <Button onPress={() => setInput(input + "7")}>7</Button>
+          <Button onPress={() => undefined}>7</Button>
           <Button onPress={() => setInput(input + "8")}>8</Button>
           <Button onPress={() => setInput(input + "9")}>9</Button>
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "7"
Received: ""

[Killed] ArrowFunction
components/Home.js:76:28
         </View>
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "7")}>7</Button>
-          <Button onPress={() => setInput(input + "8")}>8</Button>
+          <Button onPress={() => undefined}>8</Button>
           <Button onPress={() => setInput(input + "9")}>9</Button>
           <Button onPress={() => addOperator("x")} backgroundColor="#ffa31a">
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "78"
Received: "7"

[Killed] StringLiteral
components/Home.js:76:51
         </View>
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "7")}>7</Button>
-          <Button onPress={() => setInput(input + "8")}>8</Button>
+          <Button onPress={() => setInput(input + "")}>8</Button>
           <Button onPress={() => setInput(input + "9")}>9</Button>
           <Button onPress={() => addOperator("x")} backgroundColor="#ffa31a">
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "78"
Received: "7"

[Killed] ArrowFunction
components/Home.js:77:28
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "7")}>7</Button>
           <Button onPress={() => setInput(input + "8")}>8</Button>
-          <Button onPress={() => setInput(input + "9")}>9</Button>
+          <Button onPress={() => undefined}>9</Button>
           <Button onPress={() => addOperator("x")} backgroundColor="#ffa31a">
             x
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "789"
Received: "78"

[Killed] ArrowFunction
components/Home.js:78:28
           <Button onPress={() => setInput(input + "7")}>7</Button>
           <Button onPress={() => setInput(input + "8")}>8</Button>
           <Button onPress={() => setInput(input + "9")}>9</Button>
-          <Button onPress={() => addOperator("x")} backgroundColor="#ffa31a">
+          <Button onPress={() => undefined} backgroundColor="#ffa31a">
             x
           </Button>
killedBy: Unit Testing Suite Multiply button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "123"
Received: "61.52"

[Killed] ArrowFunction
components/Home.js:83:28
           </Button>
         </View>
         <View style={styles.row}>
-          <Button onPress={() => setInput(input + "4")}>4</Button>
+          <Button onPress={() => undefined}>4</Button>
           <Button onPress={() => setInput(input + "5")}>5</Button>
           <Button onPress={() => setInput(input + "6")}>6</Button>
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "4"
Received: ""

[Killed] StringLiteral
components/Home.js:83:51
           </Button>
         </View>
         <View style={styles.row}>
-          <Button onPress={() => setInput(input + "4")}>4</Button>
+          <Button onPress={() => setInput(input + "")}>4</Button>
           <Button onPress={() => setInput(input + "5")}>5</Button>
           <Button onPress={() => setInput(input + "6")}>6</Button>
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "4"
Received: ""

[Killed] ArrowFunction
components/Home.js:84:28
         </View>
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "4")}>4</Button>
-          <Button onPress={() => setInput(input + "5")}>5</Button>
+          <Button onPress={() => undefined}>5</Button>
           <Button onPress={() => setInput(input + "6")}>6</Button>
           <Button onPress={() => addOperator("-")} backgroundColor="#ffa31a">
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "45"
Received: "4"

[Killed] StringLiteral
components/Home.js:84:51
         </View>
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "4")}>4</Button>
-          <Button onPress={() => setInput(input + "5")}>5</Button>
+          <Button onPress={() => setInput(input + "")}>5</Button>
           <Button onPress={() => setInput(input + "6")}>6</Button>
           <Button onPress={() => addOperator("-")} backgroundColor="#ffa31a">
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "45"
Received: "4"

[Killed] ArrowFunction
components/Home.js:85:28
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "4")}>4</Button>
           <Button onPress={() => setInput(input + "5")}>5</Button>
-          <Button onPress={() => setInput(input + "6")}>6</Button>
+          <Button onPress={() => undefined}>6</Button>
           <Button onPress={() => addOperator("-")} backgroundColor="#ffa31a">
             -
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "456"
Received: "45"

[Killed] StringLiteral
components/Home.js:85:51
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "4")}>4</Button>
           <Button onPress={() => setInput(input + "5")}>5</Button>
-          <Button onPress={() => setInput(input + "6")}>6</Button>
+          <Button onPress={() => setInput(input + "")}>6</Button>
           <Button onPress={() => addOperator("-")} backgroundColor="#ffa31a">
             -
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "456"
Received: "45"

[Killed] ArrowFunction
components/Home.js:86:28
           <Button onPress={() => setInput(input + "4")}>4</Button>
           <Button onPress={() => setInput(input + "5")}>5</Button>
           <Button onPress={() => setInput(input + "6")}>6</Button>
-          <Button onPress={() => addOperator("-")} backgroundColor="#ffa31a">
+          <Button onPress={() => undefined} backgroundColor="#ffa31a">
             -
           </Button>
killedBy: Unit Testing Suite Minus button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "60.5"
Received: "61.51"

[Killed] ArrowFunction
components/Home.js:91:28
           </Button>
         </View>
         <View style={styles.row}>
-          <Button onPress={() => setInput(input + "1")}>1</Button>
+          <Button onPress={() => undefined}>1</Button>
           <Button onPress={() => setInput(input + "2")}>2</Button>
           <Button onPress={() => setInput(input + "3")}>3</Button>
killedBy: Unit Testing Suite Minus button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "60.5"
Received: "61.5"

[Killed] ArrowFunction
components/Home.js:92:28
         </View>
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "1")}>1</Button>
-          <Button onPress={() => setInput(input + "2")}>2</Button>
+          <Button onPress={() => undefined}>2</Button>
           <Button onPress={() => setInput(input + "3")}>3</Button>
           <Button onPress={() => addOperator("+")} backgroundColor="#ffa31a">
killedBy: Unit Testing Suite Div button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "61.5"
Received: "123"

[Killed] ArrowFunction
components/Home.js:93:28
         <View style={styles.row}>
           <Button onPress={() => setInput(input + "1")}>1</Button>
           <Button onPress={() => setInput(input + "2")}>2</Button>
-          <Button onPress={() => setInput(input + "3")}>3</Button>
+          <Button onPress={() => undefined}>3</Button>
           <Button onPress={() => addOperator("+")} backgroundColor="#ffa31a">
             +
killedBy: Unit Testing Suite Plus button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "64.5"
Received: "61.5"

[Killed] ArrowFunction
components/Home.js:94:28
           <Button onPress={() => setInput(input + "1")}>1</Button>
           <Button onPress={() => setInput(input + "2")}>2</Button>
           <Button onPress={() => setInput(input + "3")}>3</Button>
-          <Button onPress={() => addOperator("+")} backgroundColor="#ffa31a">
+          <Button onPress={() => undefined} backgroundColor="#ffa31a">
             +
           </Button>
killedBy: Unit Testing Suite Plus button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "64.5"
Received: "61.53"

[Killed] StringLiteral
components/Home.js:94:46
           <Button onPress={() => setInput(input + "1")}>1</Button>
           <Button onPress={() => setInput(input + "2")}>2</Button>
           <Button onPress={() => setInput(input + "3")}>3</Button>
-          <Button onPress={() => addOperator("+")} backgroundColor="#ffa31a">
+          <Button onPress={() => addOperator("")} backgroundColor="#ffa31a">
             +
           </Button>
killedBy: Unit Testing Suite Plus button works correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "64.5"
Received: "61.53"

[Killed] ArrowFunction
components/Home.js:99:28
           </Button>
         </View>
         <View style={styles.row}>
-          <Button onPress={() => setInput(input + "0")} width={160}>
+          <Button onPress={() => undefined} width={160}>
             0
           </Button>
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "7890"
Received: "789"
