[Killed] ArrowFunction
components/Home.js:102:28
           <Button onPress={() => setInput(input + "0")} width={160}>
             0
           </Button>
-          <Button onPress={() => setInput(input + ".")}>.</Button>
+          <Button onPress={() => undefined}>.</Button>
 
           <Button onPress={caculate} backgroundColor="#ffa31a">
killedBy: Unit Testing Suite Number Buttons work correctly
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "7890."
Received: "7890"

[Killed] ObjectLiteral
components/Home.js:113:34
   );
 };
 
-const styles = StyleSheet.create({
-  buttonContainer: {
-    flexDirection: "column",
-    justifyContent: "space-around",
-    flex: 1,
-  },
-  container: {
-    flex: 1,
-    padding: 20,
-    paddingTop: StatusBar.currentHeight + 20,
-    width: "100%",
-  },
-  row: {
-    flexDirection: "row",
-    justifyContent: "space-around",
-  },
-});
+const styles = StyleSheet.create({});
 
 export default Home;
killedBy: UI Testing Suite Home screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Home screen matches snapshot 1`

- Snapshot  - 59
+ Received  +  7

@@ -1,15 +1,6 @@

[Killed] StringLiteral
components/Home.js:115:20
 
 const styles = StyleSheet.create({
   buttonContainer: {
-    flexDirection: "column",
+    flexDirection: "",
     justifyContent: "space-around",
     flex: 1,
killedBy: UI Testing Suite Home screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Home screen matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -28,11 +28,11 @@

[Killed] ObjectLiteral
components/Home.js:119:14
     justifyContent: "space-around",
     flex: 1,
   },
-  container: {
-    flex: 1,
-    padding: 20,
-    paddingTop: StatusBar.currentHeight + 20,
-    width: "100%",
-  },
+  container: {},
   row: {
     flexDirection: "row",
killedBy: UI Testing Suite Home screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Home screen matches snapshot 1`

- Snapshot  - 8
+ Received  + 1

@@ -1,14 +1,7 @@

[Killed] ArithmeticOperator
components/Home.js:122:17
   container: {
     flex: 1,
     padding: 20,
-    paddingTop: StatusBar.currentHeight + 20,
+    paddingTop: StatusBar.currentHeight - 20,
     width: "100%",
   },
killedBy: UI Testing Suite Home screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Home screen matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,11 +1,11 @@

[Killed] StringLiteral
components/Home.js:127:21
   },
   row: {
     flexDirection: "row",
-    justifyContent: "space-around",
+    justifyContent: "",
   },
 });
killedBy: UI Testing Suite Home screen matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Home screen matches snapshot 1`

- Snapshot  - 5
+ Received  + 5

@@ -37,11 +37,11 @@
