[Killed] BlockStatement
components/TextBox.js:7:7
 const TextBox = ({
     value,
     onChangeText,
-}) => {
-    return (
-        <TextInput
-            maxLength={10}
-            testID="text-input"
-            value={value}
-            keyboardType="number-pad"
-            showSoftInputOnFocus={false}
-            onChangeText={onChangeText}
-            style={styles.input}
-        />
-    );
-};
+}) => {};
 
 const styles = StyleSheet.create({
killedBy: Unit Testing Suite AC Button works correctly
statusReason: Error: Unable to find an element with testID: text-input

<View>
  <View>
    <View>
      <View
        accessible={true}
      >

[Killed] BooleanLiteral
components/TextBox.js:14:35
             testID="text-input"
             value={value}
             keyboardType="number-pad"
-            showSoftInputOnFocus={false}
+            showSoftInputOnFocus={true}
             onChangeText={onChangeText}
             style={styles.input}
killedBy: UI Testing Suite Text box component matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Text box component matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -1,9 +1,9 @@

[Killed] StringLiteral
components/TextBox.js:24:17
 const styles = StyleSheet.create({
     input: {
         width: "100%",
-        height: "30%",
+        height: "",
         fontSize: 75,
         textAlign: "right",
killedBy: UI Testing Suite Text box component matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Text box component matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -5,11 +5,11 @@

[Killed] StringLiteral
components/TextBox.js:27:16
         height: "30%",
         fontSize: 75,
         textAlign: "right",
-        color: "black",
+        color: "",
         fontWeight: "300",
     },
killedBy: UI Testing Suite Text box component matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `UI Testing Suite Text box component matches snapshot 1`

- Snapshot  - 1
+ Received  + 1

@@ -2,11 +2,11 @@
